RT-Thread/rt-thread/bsp/lm4f232/Libraries/driverlib/lpc.c
    //
    // Disable the specified channel.
    //
    HWREG(ulBase + LPC_O_CTL) &= ~(1 << ulChannel);
}

//*****************************************************************************
//
//! Sets the configuration of an LPC Channel as an endpoint.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulChannel specifies the LPC channel to configure.
//! \param ulConfig specifies configuration options required for the endpoint.
//! \param ulOffset specifies the offset from the beginning of the buffer pool
//! for this endpoint's data.
//! \param ulAddress specifies the LPC bus address (IO and/or MEM) for this
//! channel.
//!
//! The specified LPC Channel is enabled as an endpoint.
//!
//! \return None.
//
//*****************************************************************************
void
LPCChannelConfigEPSet(unsigned long ulBase, unsigned long ulChannel,
                      unsigned long ulConfig, unsigned long ulAddress,
                      unsigned long ulOffset)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT(LPCChannelValid(ulChannel));
    ASSERT((ulConfig & ~(LPC_CH0CTL_IRQSEL1_M | LPC_CH0CTL_IRQSEL0_M |
                         LPC_CH0CTL_IRQEN1 | LPC_CH0CTL_IRQEN0_M)) == 0);
    ASSERT((ulOffset & 3) == 0);
    ASSERT(ulOffset < ((((HWREG(ulBase + LPC_O_STS) & LPC_STS_POOLSZ_M) >>
              16) * 256) - 4));

    //
    // Convert the byte offset address into a half-word
    // offset address and add into the control word.
    //
    ulConfig |= (((ulOffset >> 1) << LPC_CH0CTL_OFFSET_S) &
                 LPC_CH0CTL_OFFSET_M);

    //
    // Write the final control value into the control word for
    // the channel.
    //
    HWREG(ulBase + LPC_O_CH0CTL + (ulChannel * 0x10)) = ulConfig;

    //
    // Setup the IO and/or MEM address to match for this channel.
    //
    HWREG(ulBase + LPC_O_CH0ADR + (ulChannel * 0x10)) = ulAddress;
}

//*****************************************************************************
//
//! Sets the configuration of an LPC Channel as a mailbox.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulChannel specifies the LPC channel to configure.
//! \param ulConfig specifies configuration options required for the endpoint.
//! \param ulOffset specifies the offset from the beginning of the buffer pool
//! for this endpoint's data.
//! \param ulAddress specifies the LPC bus address (IO and/or MEM) for this
//! channel.
//!
//! The specified LPC Channel is enabled as a mailbox.
//!
//! \return None.
//
//*****************************************************************************
void
LPCChannelConfigMBSet(unsigned long ulBase, unsigned long ulChannel,
                      unsigned long ulConfig, unsigned long ulAddress,
                      unsigned long ulOffset)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT(LPCChannelValid(ulChannel));
    ASSERT((ulConfig & ~(LPC_CH0CTL_IRQSEL1_M | LPC_CH0CTL_IRQSEL1_M |
                         LPC_CH0CTL_IRQSEL0_M |
                         LPC_CH0CTL_IRQEN2 | LPC_CH0CTL_IRQEN1 |
                         LPC_CH0CTL_IRQEN0_M |
                         LPC_CH0CTL_ARBDIS | LPC_CH0CTL_AMASK_M)) == 0);
    ASSERT((ulOffset & 3) == 0);
    ASSERT(ulOffset < ((((HWREG(ulBase + LPC_O_STS) & LPC_STS_POOLSZ_M) >>
              16) * 256) - 4));

    //
    // Convert the byte offset address into a half-word
    // offset address and add into the control word.
    //
    ulConfig |= (((ulOffset >> 1) << LPC_CH0CTL_OFFSET_S) &
                 LPC_CH0CTL_OFFSET_M);

    //
    // Set the configuration bit that enables Mailbox mode.
    //
    ulConfig |= LPC_CH0CTL_TYPE;

    //
    // Write the final control value into the control word for
    // the channel.
    //
    HWREG(ulBase + LPC_O_CH0CTL + (ulChannel * 0x10)) = ulConfig;

    //
    // Setup the IO and/or MEM address to match for this channel.
    //
    HWREG(ulBase + LPC_O_CH0ADR + (ulChannel * 0x10)) = ulAddress;
}

//*****************************************************************************
//
//! Sets the configuration of an LPC Channel as a COMx.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulChannel specifies the LPC channel to configure.
//! \param ulConfig specifies configuration options required for the endpoint.
//! \param ulOffset specifies the offset from the beginning of the buffer pool
//! for this endpoint's data.
//! \param ulAddress specifies the LPC bus address (IO and/or MEM) for this
//! channel.
//! \param ulCOMxMode specifies the COMx mode to be used.
//!
//! The specified LPC Channel is enabled as a COMx.
//!
//! \return None.
//
//*****************************************************************************
void
LPCChannelConfigCOMxSet(unsigned long ulBase, unsigned long ulChannel,
                        unsigned long ulConfig, unsigned long ulAddress,
                        unsigned long ulOffset, unsigned long ulCOMxMode)
{
    unsigned long ulTemp;

    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT(LPCChannelValid(ulChannel));
    ASSERT(ulChannel == LPC_CHAN_COMx);
    ASSERT((ulConfig & ~(LPC_CH7CTL_IRQSEL1_M | LPC_CH7CTL_IRQSEL0_M |
                         LPC_CH7CTL_CX | LPC_CH7CTL_IRQEN1 |
                         LPC_CH7CTL_IRQEN0_M)) == 0);
    ASSERT((ulOffset & 3) == 0);
    ASSERT(ulOffset < ((((HWREG(ulBase + LPC_O_STS) & LPC_STS_POOLSZ_M) >>
              16) * 256) - 4));
    ASSERT((ulCOMxMode & ~LPC_DMACX_CXACT_M) == 0);

    //
    // Convert the byte offset address into a half-word
    // offset address and add into the control word.
    //
    ulConfig |= (((ulOffset >> 1) << LPC_CH0CTL_OFFSET_S) &
                 LPC_CH0CTL_OFFSET_M);

    //
    // Write the final control value into the control word for
    // the channel.
    //
    HWREG(ulBase + LPC_O_CH0CTL + (ulChannel * 0x10)) = ulConfig;

    //
    // Setup the IO and/or MEM address to match for this channel.
    //
    HWREG(ulBase + LPC_O_CH0ADR + (ulChannel * 0x10)) = ulAddress;

    //
    // Configure the COMx Mode for this channel.
    //
    ulTemp = HWREG(ulBase + LPC_O_DMACX);
    ulTemp &= ~LPC_DMACX_CXACT_M;
    ulTemp |= ulCOMxMode;
    ulTemp |= LPC_DMACX_COMX;
    HWREG(ulBase + LPC_O_DMACX) = ulTemp;
}

//*****************************************************************************
//
//! Gets the configuration of an LPC Channel.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulChannel specifies the LPC channel to configure.
//! \param pulOffset is a pointer to storage for the channel pool offset.
//! \param pulAddress is a pointer to storage for the channel bus address.
//! \param pulCOMxMode is a pointer to storage for the channel COMx mode.
//!
//! The configuration for the specified channel is determined and returned.
//!
//! \return Returns the bit-mapped channel control register value.
//
//*****************************************************************************
unsigned long
LPCChannelConfigGet(unsigned long ulBase, unsigned long ulChannel,
                    unsigned long *pulAddress, unsigned long *pulOffset,
                    unsigned long *pulCOMxMode)
{
    unsigned long ulConfig;

    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT(LPCChannelValid(ulChannel));

    //
    // Read the channel control register.
    //
    ulConfig = HWREG(ulBase + LPC_O_CH0CTL + (ulChannel * 0x10));

    //
    // Get the buffer pool offset value.
    //
    if(pulOffset)
    {
        *pulOffset = ((ulConfig & LPC_CH0CTL_OFFSET_M) >>
                      (LPC_CH0CTL_OFFSET_S - 1));
    }

    //
    // Get the IO/Memory address that this endpoint will respond
    // to.
    //
    if(pulAddress)
    {
        *pulAddress = HWREG(ulBase + LPC_O_CH0ADR + (ulChannel * 0x10));
    }

    //
    // Configure the COMx Mode for this channel.
    //
    if(pulCOMxMode && (ulChannel == LPC_CHAN_COMx))
    {
        *pulCOMxMode = (HWREG(ulBase + LPC_O_DMACX) & 0x00070000);
    }

    //
    // Return the raw config value.
    //
    return(ulConfig);
}

//*****************************************************************************
//
//! Gets the absolute base address of the channel pool.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulChannel specifies the LPC channel to configure.
//!
//! The absolute address of the channel pool is calculated from the channel
//! configuration setting and returned.
//!
//! \return Returns absolute base address of the channel pool.
//
//*****************************************************************************
unsigned long
LPCChannelPoolAddressGet(unsigned long ulBase, unsigned long ulChannel)
{
    unsigned long ulAddress;

    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT(LPCChannelValid(ulChannel));

    //
    // Read the channel control register.
    //
    ulAddress = HWREG(ulBase + LPC_O_CH0CTL + (ulChannel * 0x10));

    //
    // Mask off the channel offset portion and shift it into a byte
    // offset (stored as half-word offset).
    //
    ulAddress = ((ulAddress & LPC_CH0CTL_OFFSET_M) >>
                 (LPC_CH0CTL_OFFSET_S - 1));

    //
    // Add the LPC and Buffer Pool base address to get the final
    // address to return.
    //
    ulAddress += (ulBase + LPC_O_POOL);

    //
    // Return the address to the calling routine.
    //
    return(ulAddress);
}

//*****************************************************************************
//
//! Reads the status word from an LPC Channel.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulChannel specifies the LPC Channel.
//!
//! Reads the status word from an LPC channel and returns it to the caller.
//!
//! \return content of the channel status register.
//
//*****************************************************************************
unsigned long
LPCChannelStatusGet(unsigned long ulBase, unsigned long ulChannel)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT(LPCChannelValid(ulChannel));

    //
    // Read the half-word status from the LPC Channel
    //
    return (HWREG(ulBase + LPC_O_CH0ST + (ulChannel * 0x10)));
}

//*****************************************************************************
//
//! Sets the user bits in the status word (16-bits) of an LPC Channel.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulChannel specifies the LPC Channel.
//! \param ulStatus is the user bit values to set.
//!
//! Sets the selected user bits of the status word for an LPC channel.
//!
//! \return None
//
//*****************************************************************************
void
LPCChannelStatusSet(unsigned long ulBase, unsigned long ulChannel,
                    unsigned long ulStatus)
{
    unsigned long ulTemp;

    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT(LPCChannelValid(ulChannel));
    ASSERT((ulStatus & (~LPC_CH0ST_USER_M)) == 0);

    //
    // Read thestatus from the LPC Channel, and set new values for
    // the user bits.
    //
    ulTemp = HWREG(ulBase + LPC_O_CH0ST + (ulChannel * 0x10));
    ulTemp |= ulStatus;
    HWREG(ulBase + LPC_O_CH0ST + (ulChannel * 0x10)) = ulTemp;
}

//*****************************************************************************
//
//! Clears the user bits in the status word (16-bits) of an LPC Channel.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulChannel specifies the LPC Channel.
//! \param ulStatus is the user bit values to clear.
//!
//! Sets the selected user bits of the status word for an LPC channel.
//!
//! \return None
//
//*****************************************************************************
void
LPCChannelStatusClear(unsigned long ulBase, unsigned long ulChannel,
                      unsigned long ulStatus)
{
    unsigned long ulTemp;

    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT(LPCChannelValid(ulChannel));
    ASSERT((ulStatus & (~LPC_CH0ST_USER_M)) == 0);

    //
    // Read thestatus from the LPC Channel, and set new values for
    // the user bits.
    //
    ulTemp = HWREG(ulBase + LPC_O_CH0ST + (ulChannel * 0x10));
    ulTemp &= ~ulStatus;
    HWREG(ulBase + LPC_O_CH0ST + (ulChannel * 0x10)) = ulTemp;
}

//*****************************************************************************
//
//! Sets the configuration of DMA for LPC channels.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulConfig specifies the DMA channel configuration.
//! \param ulMask specifies the configuration mask to be used.
//!
//! Sets the specified DMA channel operation based on the \e ulConfig
//! parameter.
//!
//! \return None.
//
//*****************************************************************************
void
LPCChannelDMAConfigSet(unsigned long ulBase, unsigned long ulConfig,
                       unsigned long ulMask)
{
    unsigned long ulTemp;

    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT((ulConfig & ~0x000000FF) == 0);
    ASSERT((ulConfig & 0x00000003) != 0x00000003);
    ASSERT((ulConfig & 0x0000000C) != 0x0000000C);
    ASSERT((ulConfig & 0x00000030) != 0x00000030);
    ASSERT((ulConfig & 0x000000C0) != 0x000000C0);
    ASSERT((ulMask & ~0x000000FF) == 0);

    //
    // Get the current mask value.
    //
    ulTemp = HWREG(ulBase + LPC_O_DMACX);
    ulTemp &= ~ulMask;
    ulTemp |= (ulConfig & ulMask);
    HWREG(ulBase + LPC_O_DMACX) = ulTemp;
}

//*****************************************************************************
//
//! Gets the configuration of DMA for LPC channels.
//!
//! \param ulBase specifies the LPC module base address.
//!
//! Returns the configuration of the LPC DMA channels.
//!
//! \return Returns the bit-mapped DMA channel configuration.
//
//*****************************************************************************
unsigned long
LPCChannelDMAConfigGet(unsigned long ulBase)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);

    //
    // Get the current mask value.
    //
    return(HWREG(ulBase + LPC_O_DMACX) & 0x000000FF);
}

//*****************************************************************************
//
//! Reads a byte from the LPC channel pool.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulOffset specifies the offset from the beginning of the LPC channel
//! pool.
//!
//! This function may be called to read a byte from the channel pool.
//!
//! \return Returns the byte read from the pool memory.
//
//*****************************************************************************
unsigned char
LPCByteRead(unsigned long ulBase, unsigned long ulOffset)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT(ulOffset < (((HWREG(ulBase + LPC_O_STS) & LPC_STS_POOLSZ_M) >>
                        16) * 256));

    //
    // Return the byte from the LPC Buffer Pool.
    //
    return(HWREGB(ulBase + LPC_O_POOL + ulOffset));
}

//*****************************************************************************
//
//! Writes a byte to the LPC channel pool.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulOffset specifies the offset from the beginning of the LPC channel
//! pool.
//! \param ucData specifies the byte to write.
//!
//! Ths function may be called to write a byte to the channel pool.
//!
//! \return None
//
//*****************************************************************************
void
LPCByteWrite(unsigned long ulBase, unsigned long ulOffset,
             unsigned char ucData)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT(ulOffset < (((HWREG(ulBase + LPC_O_STS) & LPC_STS_POOLSZ_M) >>
                        16) * 256));

    //
    // Write the byte to the LPC Buffer Pool.
    //
    HWREGB(ulBase + LPC_O_POOL + ulOffset) = ucData;
}

//*****************************************************************************
//
//! Reads a half-word from the LPC channel pool.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulOffset specifies the offset from the beginning of the LPC channel
//! pool.
//!
//! This function may be called to read a half-word from the channel pool.  The
//! \e ulOffset specified must be half-word aligned.
//!
//! \return Returns the half-word read from the pool memory.
//
//*****************************************************************************
unsigned short
LPCHalfWordRead(unsigned long ulBase, unsigned long ulOffset)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT((ulOffset & 1) == 0);
    ASSERT(ulOffset < (((HWREG(ulBase + LPC_O_STS) & LPC_STS_POOLSZ_M) >>
                        16) * 256));

    //
    // Return the half-word from the LPC Buffer Pool.
    //
    return(HWREGH(ulBase + LPC_O_POOL + ulOffset));
}

//*****************************************************************************
//
//! Writes a half-word to the LPC channel pool.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulOffset specifies the offset from the beginning of the LPC channel
//! pool.
//! \param usData specifies the byte to write.
//!
//! Ths function may be called to write a half-word to the channel pool.  The
//! \e ulOffset specified must be half-word aligned.
//!
//! \return None
//
//*****************************************************************************
void
LPCHalfWordWrite(unsigned long ulBase, unsigned long ulOffset,
                 unsigned short usData)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT((ulOffset & 1) == 0);
    ASSERT(ulOffset < (((HWREG(ulBase + LPC_O_STS) & LPC_STS_POOLSZ_M) >>
                        16) * 256));

    //
    // Write the half-word to the LPC Buffer Pool.
    //
    HWREGH(ulBase + LPC_O_POOL + ulOffset) = usData;
}

//*****************************************************************************
//
//! Reads a word from the LPC channel pool.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulOffset specifies the offset from the beginning of the LPC channel
//! pool.
//!
//! This function may be called to read a word from the channel pool.  The
//! \e ulOffset specified must be word aligned.
//!
//! \return Returns the half-word read from the pool memory.
//
//*****************************************************************************
unsigned long
LPCWordRead(unsigned long ulBase, unsigned long ulOffset)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT((ulOffset & 3) == 0);
    ASSERT(ulOffset < (((HWREG(ulBase + LPC_O_STS) & LPC_STS_POOLSZ_M) >>
                        16) * 256));

    //
    // Return the word from the LPC Buffer Pool.
    //
    return(HWREG(ulBase + LPC_O_POOL + ulOffset));
}

//*****************************************************************************
//
//! Writes a byte to the LPC channel pool.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulOffset specifies the offset from the beginning of the LPC channel
//! pool.
//! \param ulData specifies the byte to write.
//!
//! Ths function may be called to write a half-word to the channel pool.  The
//! \e ulOffset specified must be half-word aligned.
//!
//! \return None
//
//*****************************************************************************
void
LPCWordWrite(unsigned long ulBase, unsigned long ulOffset,
             unsigned long ulData)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT((ulOffset & 1) == 0);
    ASSERT(ulOffset < (((HWREG(ulBase + LPC_O_STS) & LPC_STS_POOLSZ_M) >>
                        16) * 256));

    //
    // Write the word to the LPC Buffer Pool.
    //
    HWREG(ulBase + LPC_O_POOL + ulOffset) = ulData;
}

//*****************************************************************************
//
//! Enables individual COMx interrupt sources.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulIntFlags is a bit mask of the interrupt sources to be enabled.
//!
//! Enables the indicated COMx interrupt sources to trigger the COMx interrupt
//! in the primary LPC interrupt registers.
//!
//! \return None.
//
//*****************************************************************************
void
LPCCOMxIntEnable(unsigned long ulBase, unsigned long ulIntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT((ulIntFlags & ~(LPC_DMACX_CXEM | LPC_DMACX_CXTXEM |
                           LPC_DMACX_CXRXEM)) == 0);

    //
    // Get the current mask value.
    //
    HWREG(ulBase + LPC_O_DMACX) |= ulIntFlags;
}

//*****************************************************************************
//
//! Disables individual COMx interrupt sources.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulIntFlags is a bit mask of the interrupt sources to be disabled.
//!
//! Disables the indicated COMx interrupt sources from triggering the COMx
//! interrupt in the primary LPC interrupt registers.
//!
//! \return None.
//
//*****************************************************************************
void
LPCCOMxIntDisable(unsigned long ulBase, unsigned long ulIntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT((ulIntFlags & ~(LPC_DMACX_CXEM | LPC_DMACX_CXTXEM |
                           LPC_DMACX_CXRXEM)) == 0);

    //
    // Disable the specified interrupts.
    //
    HWREG(ulBase + LPC_O_DMACX) &= ~ulIntFlags;
}

//*****************************************************************************
//
//! Gets the current COMx interrupt status.
//!
//! \param ulBase specifies the LPC module base address.
//! \param bMasked is \b false if the raw interrupt status is required or
//! \b true if the masked interrupt status is required.
//!
//! This function returns the interrupt status for the COMx module.
//!
//! \return The current interrupt status.
//
//*****************************************************************************
unsigned long
LPCCOMxIntStatus(unsigned long ulBase, tBoolean bMasked)
{
    unsigned long ulStatus;

    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);

    //
    // Return either the interrupt status or the raw interrupt status as
    // requested.
    //
    ulStatus = HWREG(ulBase + LPC_O_DMACX);
    if(bMasked)
    {
        ulStatus = ulStatus & (ulStatus << 4);
    }
    return(ulStatus & (LPC_DMACX_CXRES | LPC_DMACX_CXTXRES |
                           LPC_DMACX_CXRXRES));
}

//*****************************************************************************
//
//! Clears COMx interrupt sources.
//!
//! \param ulBase specifies the LPC module base address.
//! \param ulIntFlags is a bit mask of the interrupt sources to be cleared.
//!
//! The specified COMx interrupt sources are cleared so that they no longer
//! assert.
//!
//! \return None.
//
//*****************************************************************************
void
LPCCOMxIntClear(unsigned long ulBase, unsigned long ulIntFlags)
{
    //
    // Check the arguments.
    //
    ASSERT(ulBase == LPC0_BASE);
    ASSERT((ulIntFlags & ~(LPC_DMACX_CXRES | LPC_DMACX_CXTXRES |
                           LPC_DMACX_CXRXRES)) == 0);

    //
    // Clear the requested interrupt sources.
    //
    HWREG(ulBase + LPC_O_DMACX) |= ulIntFlags;
}

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
